# DBeam_SetLightOrigin

## Description
Set light origin for the beam.

```pascal
PROCEDURE DBeam_SetLightOrigin(origin : REAL);
```

```python
def vs.DBeam_SetLightOrigin(origin):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|origin|REAL|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight